
// const number = Number(prompt("Введіть число"));

// console.log(number);
// if (number === 10) {
//     alert("Вірно");
// } else {
//     alert("Невірно");
// }




// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

//---------------------------------------------------------------------------------------------------
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);

// const min = Math.floor(Math.random() * 59);
// if (min <= 14) {
//     alert(`${min} входить в першу чверть`)
// } else {
    
// }

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//     for (let index = max; index >= min; index--) {
//         console.log(index);
//         let sum = 0;
//         if (index % 2 === 0) {
//             sum += index;
//         }
//         return sum;
//     }
// }

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt("Введіть логін:");

// console.log(login);

// if (login === "Адмін") {
//   const password = prompt("Введіть пароль:");

//   if (password === "Я головний") {
//     alert("Добрий день!");
//   } else if (!password) {
//     alert("Скасовано");
//   } else {
//     alert("Невірний пароль!");
//   }

// } else if (!login) {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }


// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num) {
    
//     for (let i = 1; i <= num; i++) {
//         if (i % 3 === 0 && i % 5 ===0) {
//             console.log("fizzbuzz");
//         }
//         if (i % 3 === 0) {
//             console.log("fizz");
//         }
//         if (i % 5 === 0) {
//             console.log("buzz");
//         }
//     }
// }
// fizzBuzz(9);

function sum(a, b) {
  console.log(arguments);
  return a + b;
}

sum(2, 5);